Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.LoadCase Property
 The load case. The real load cases have positive values 1, 2, 3, ... For min/max queries LoadCaseForMinMaxEnum can be used.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LoadCase { get; set; }
Public Property LoadCase As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace